<!DOCTYPE html>
<html lang="en">
<head>
    <meta charset="UTF-8">
    <meta http-equiv="X-UA-Compatible" content="IE=edge">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <title>Jose Gervasio Artigas</title>
    <link rel="stylesheet" href="css/style.css">
    <script src="https://smtpjs.com/v3/smtp.js"></script>
</head>
<body>

    <header>
        <div class="headerText">
            <h1>José Gervasio Artigas</h1>
            <p>"Sean los Orientales tan ilustrados como valientes"</p>
        </div>
        <div id="imgDiv">
            <div id="imgCaption">
                <small>Detalle pintura &oacute;leo sobre tela - <strong>"Artigas en la puerta de la Ciudadela"</strong> - Juan Manuel Blanes</small>
            </div>
        </div> 
    </header>

    <main id="main">

        <h3>L&iacute;nea de tiempo sobre la vida del pr&oacute;cer</h3>

    <section class="timeline">

        <div class="container leftContainer">
            <img src="images/artigasRostro.fw.png" alt="">
            <div class="textBox">
                <h2>1764</h2>
                <p>Artigas naci&oacute; en la ciudad de Montevideo el 19 de junio, en una de las familias fundadoras de la ciudad.</p> 
                <span class="leftArrow"></span>  
            </div>
        </div>
        
        <div class="container rightContainer">
            <img src="images/artigasRostroDer.fw.png" alt="">
            <div class="textBox">
                <h2>1772</h2>
                <p>Junto con varios de sus hermanos y su propio padre, recibi&oacute; el Sacramento de la Confirmaci&oacute;n, el 24 de 
                    diciembre de 1772, en la estanzuela de Melchor de Viana, siendo padrinos este y su esposa Rita P&eacute;rez.</p>
                <span class="rightArrow"></span>   
            </div>
        </div>

        <div class="container leftContainer">
            <img src="images/artigasRostro.fw.png" alt="">
            <div class="textBox">
                <h2>1776</h2>
                <p>A los doce a&ntilde;os prefiri&oacute; dedicarse a las tareas rurales y se traslad&oacute; al campo, en tierras 
                    pertenecientes a su familia. Observando a los habitantes del lugar — entre ellos, los gauchos — se hizo &aacute;gil en 
                    el manejo de las armas y del caballo.</p>
                <span class="leftArrow"></span>   
            </div>
        </div>

        <div class="container rightContainer">
            <img src="images/artigasRostroDer.fw.png" alt="">
            <div class="textBox">
                <h2>1778</h2>
                <p>Su nombre aparece registrado al ingresar en la Cofrad&iacute;a del Sant&iacute;simo Rosario.</p>
                <span class="rightArrow"></span>  
            </div>
        </div>

        <div class="container leftContainer">
            <img src="images/artigasRostro.fw.png" alt="">
            <div class="textBox">
                <h2>1786</h2>
                <p>Artigas habr&iacute;a vivido con los charr&uacute;as, llegando a tener mujer e hijo dentro de esa naci&oacute;n. Este 
                    hijo, Manuel, habr&iacute;a nacido hacia el año 1786, siendo aparentemente, el primog&eacute;nito del pr&oacute;cer. 
                    Varias pruebas materializadas en cartas y en la actitud de Artigas hacia los indios, y viceversa, respaldan la existencia 
                    de este hijo.</p>
                <span class="leftArrow"></span>  
            </div>
        </div>

        <div class="container rightContainer">
            <img src="images/artigasRostroDer.fw.png" alt="">
            <div class="textBox">
                <h2>1797</h2>
                <p>A los treinta y tres a&ntilde;os, ampar&aacute;ndose en una amnist&iacute;a para quienes no tuvieran delitos de sangre, 
                    Jos&eacute; Artigas ingres&oacute; como soldado raso al reci&eacute;n creado cuerpo de Blandengues de Montevideo, una 
                    milicia especialmente autorizada por el rey de Espa&ntilde;a en el virreinato del R&iacute;o de la Plata, que ten&iacute;a 
                    como fin proteger las fronteras.</p>
                <span class="rightArrow"></span>  
            </div>
        </div>

        <div class="container leftContainer">
            <img src="images/artigasRostro.fw.png" alt="">
            <div class="textBox">
                <h2>1800</h2>
                <p>Cumpli&oacute; destacada labor en la fundaci&oacute;n de la ciudad de Batovi en las Misiones Orientales, actual estado 
                    brasile&ntilde;o de R&iacute;o Grande del Sur.</p>
                <span class="leftArrow"></span>  
            </div>
        </div>

        <div class="container rightContainer">
            <img src="images/artigasRostroDer.fw.png" alt="">
            <div class="textBox">
                <h2>1806</h2>
                <p>Ante la primera de las Invasiones Inglesas y la ocupaci&oacute;n de Buenos Aires por el ej&eacute;rcito brit&aacute;nico, 
                    colabor&oacute; con Juan Mart&iacute;n de Pueyrred&oacute;n y organiz&oacute; por s&iacute; mismo una fuerza de 300 soldados 
                    que no llegaron a entrar en combate.
                    El conocimiento adquirido hizo que desempe&ntilde;ara la tarea con &eacute;xito, siendo ascendido primero a capit&aacute;n de 
                    milicias, posici&oacute;n alcanzada antes por su padre y por su abuelo, y luego ayudante mayor.</p>
                <span class="rightArrow"></span>  
            </div>
        </div>

        <div class="container leftContainer">
            <img src="images/artigasRostro.fw.png" alt="">
            <div class="textBox">
                <h2>1811</h2>
                <p>El 15 de febrero, Artigas desert&oacute; del Cuerpo de Blandengues en Colonia del Sacramento y se traslad&oacute; a Buenos Aires 
                    para ofrecer sus servicios militares al gobierno revolucionario, que le dio el grado de teniente coronel, 150 hombres y 200 pesos 
                    para iniciar el levantamiento de la Banda Oriental contra el poder espa&ntilde;ol. La fecha en la cual Artigas desert&oacute; del 
                    ej&eacute;rcito realista en Colonia del Sacramento est&aacute; hoy establecida con precisi&oacute;n sobre la base de una nota de 
                    la revista de tropas del Cuerpo de Blandengues de Montevideo efectuada al mes siguiente. Antes de conocerse dicha nota, los 
                    historiadores fijaban el 2 o el 11 de febrero como fechas de la deserción.<br /><br />
                    La nota expresa:<i><strong>"Jos&eacute; Artigas, capit&aacute;n de la 3.a Compa&ntilde;&iacute;a, y Rafael Ortiguera, fugaron a 
                    Buenos Aires el 15 de febrero"</strong>.</i><br /><br />
                    El 11 de abril emiti&oacute; la Proclama de Mercedes y asumi&oacute; el mando de la revoluci&oacute;n en la Banda Oriental y el 
                    18 de mayo derrot&oacute; a los espa&ntilde;oles en la Batalla de Las Piedras. Luego inici&oacute; el sitio de Montevideo y fue 
                    aclamado <strong>«Primer Jefe de los Orientales»</strong>.</p>
                <span class="leftArrow"></span>  
            </div>
        </div>

        <div class="container rightContainer">
            <img src="images/artigasRostroDer.fw.png" alt="">
            <div class="textBox">
                <h2>1812</h2>
                <p>Logr&oacute; convocar a un congreso nacional en Maro&ntilde;as y all&iacute; proclam&oacute; la Provincia Oriental con gobierno federal, 
                    como modelo a seguir por las dem&aacute;s Provincias Unidas del R&iacute;o de la Plata.<br /><br />
                    Como consecuencia del armisticio firmado con el virrey Francisco Javier de El&iacute;o por la Primera Junta de Buenos Aires, las tropas 
                    enviadas a la Banda Oriental debieron abandonar dicho territorio, levantando el sitio de Montevideo.<br /><br />
                    José Artigas fue nombrado <strong>«teniente gobernador, justicia mayor y capitán del departamento de Yapey&uacute;»</strong>, entonces en la 
                    provincia de Misiones, actual Argentina.<br /><br />
                    Disgustado por el armisticio y ante la evacuaci&oacute;n de las tropas porte&ntilde;as, cumpli&oacute; con su nuevo cargo traslad&aacute;ndose 
                    al territorio misionero, por lo que decidió pasar con sus seguidores a la orilla occidental del R&iacute;o Uruguay, hecho conocido como el 
                    <strong>&Eacute;xodo oriental</strong>. Cruz&oacute; el R&iacute;o Uruguay con mil carretas y unas 16 000 personas con sus ganados y pertenencias, 
                    en la primera semana de enero de 1812, instalando su campamento cerca del arroyo Ayu&iacute; Grande, pocos kil&oacute;metros al norte de la actual 
                    ciudad entrerriana de Concordia, entonces perteneciente a la jurisdicci&oacute;n de Misiones.</p>
                <span class="rightArrow"></span>  
            </div>
        </div>

        <div class="container leftContainer">
            <img src="images/artigasRostro.fw.png" alt="">
            <div class="textBox">
                <h2>1813</h2>
                <p>En el campamento de Jos&eacute; Artigas fueron elegidos los diputados orientales que deb&iacute;an concurrir a la <strong>Asamblea General Constituyente 
                    del a&ntilde;o XIII</strong> a celebrarse en Buenos Aires. Artigas le dio instrucciones a sus diputados, las que fueron dictadas el 13 de abril.<br /><br />
                    Los diplomas de los diputados orientales fueron rechazados por la Asamblea, usando como argumento legal la nulidad de su elecci&oacute;n porque se realiz&oacute; 
                    en un campamento militar y adem&aacute;s porque Artigas les hab&iacute;a impartido instrucciones, a pesar de que la Asamblea se hab&iacute;a declarado soberana.</p>
                <span class="leftArrow"></span>  
            </div>
        </div>

        <div class="container rightContainer">
            <img src="images/artigasRostroDer.fw.png" alt="">
            <div class="textBox">
                <h2>1814</h2>
                <p>Ante este atropello a la voluntad popular, Artigas abandon&oacute; el sitio de Montevideo a mediados de enero. Se dirigi&oacute; a la costa del R&iacute;o Uruguay, 
                    desde donde sus partidarios lanzaron una serie de campa&ntilde;as para controlar el interior de la Banda Oriental y Entre R&iacute;os.<br /><br />
                    Tras el retiro de Artigas del sitio de Montevideo, el unitario Director Supremo de las Provincias Unidas del R&iacute;o de la Plata, Gervasio Antonio Posadas, firm&oacute; 
                    un decreto el 11 de febrero, declarando a Artigas <strong>«traidor a la Patria»</strong>. Se lo acus&oacute; de conspirar contra la unidad de los patriotas rioplatenses 
                    que luchaban para tomar Montevideo, el principal basti&oacute;n realista en el R&iacute;o de la Plata, y de esa manera contradecir los planes revolucionarios para continuar 
                    la guerra contra los realistas en el Alto Per&uacute;.<br /><br />
                    Ese mismo a&ntilde;o, organiz&oacute; la Uni&oacute;n de los Pueblos Libres, de la que fue declarado <strong>«protector»</strong>.</p>
                <span class="rightArrow"></span>  
            </div>
        </div>

        <div class="container leftContainer">
            <img src="images/artigasRostro.fw.png" alt="">
            <div class="textBox">
                <h2>1816</h2>
                <p>El 9 de julio, se declar&oacute; en el Congreso de Tucum&aacute;n la independencia de las Provincias Unidas del R&iacute;o de la Plata, pero en el mismo, con excepci&oacute;n 
                    de C&oacute;rdoba, no fueron representadas las provincias pertenecientes a la Liga de los Pueblos Libres, que estaban bajo la autoridad de Jos&eacute; Artigas.<br /><br />
                    El constante crecimiento de influencia y prestigio de la Liga Federal atemorizó tanto a los unitarios de Buenos Aires y Montevideo como al Reino Unido de Portugal, Brasil y Algarve. 
                    En agosto, numerosas tropas luso-brasile&ntilde;as invadieron la Provincia Oriental. Debido a su superioridad num&eacute;rica y material, las fuerzas luso-brasile&ntilde;as al mando 
                    de Carlos Federico Lecor vencieron a Artigas y sus lugartenientes.</p>
                <span class="leftArrow"></span>  
            </div>
        </div>

        <div class="container rightContainer">
            <img src="images/artigasRostroDer.fw.png" alt="">
            <div class="textBox">
                <h2>1820</h2>
                <p>Despu&eacute;s de tres a&ntilde;os y medio de resistencia, la batalla de Tacuaremb&oacute;, del 22 de enero, signific&oacute; la derrota definitiva de Artigas, que debi&oacute; 
                    abandonar la Provincia Oriental, a la que ya no volvi&oacute;.<br /><br />
                    Rodeado por todos lados por los lugartenientes de Francisco Ram&iacute;rez y viendo su causa definitivamente perdida, el 5 de septtiembre, Jos&eacute; Artigas cruz&oacute; el 
                    R&iacute;o Paran&aacute; hacia el exilio en Paraguay, dejando atr&aacute;s su patria y su familia.<br /><br/>
                    El dictador paraguayo Jos&eacute; Gaspar Rodr&iacute;guez de Francia le dio refugio, pero cuid&oacute; que no conservara ninguna influencia pol&iacute;tica, ni mantuviera 
                    correspondencia con nadie fuera del Paraguay. Su &uacute;nico acompa&ntilde;ante durante el resto de su vida fue el Negro Ansina.</p>
                <span class="rightArrow"></span>  
            </div>
        </div>

        <div class="container leftContainer">
            <img src="images/artigasRostro.fw.png" alt="">
            <div class="textBox">
                <h2>1840</h2>
                <p>No obstante su pasividad en el exilio, por mera precauci&oacute;n, fue arrestado algunas semanas despu&eacute;s de la muerte del dictador, ocurrida el 20 de septiembre. El nuevo 
                    gobierno de Carlos Antonio L&oacute;pez, primer presidente constitucional del Paraguay lo traslad&oacute; a Asunci&oacute;n, donde disfrut&oacute; de su pl&aacute;cida ancianidad en el 
                    barrio asunceno de Trinidad, residiendo en la propia quinta Ybyray del presidente de la rep&uacute;blica, rodeado del afecto de los paraguayos.</p>
                <span class="leftArrow"></span>  
            </div>
        </div>

        <div class="container rightContainer">
            <img src="images/artigasRostroDer.fw.png" alt="">
            <div class="textBox">
                <h2>1850</h2>
                <p>All&iacute; falleci&oacute;, diez a&ntilde;os despu&eacute;s, el 23 de septiembre, a los 86 a&ntilde;os de edad.</p>
                <span class="rightArrow"></span>  
            </div>
        </div>
    </section>
    
    </main>

    <section class="quoteContainer">
        <div class="frases">
            <h2>Frases de Artigas</h2>
        </div>
        <blockquote class="blockquote quoteBorder orderOne">
            <p class="quoteText">“Yo no soy vendible, ni quiero m&aacute;s premio por mí empe&ntilde;o que ver libre mi naci&oacute;n del poder&iacute;o espa&ntilde;ol."</p>
            <p class="cite">-- Jos&eacute; Gervasio Artigas</p>    
        </blockquote>
        <blockquote class="blockquote quoteBorder orderTwo">
            <p class="quoteText">“Los pueblos de Am&eacute;rica del Sur est&aacute;n &iacute;ntimamente unidos por v&iacute;nculos de naturaleza e intereses rec&iacute;procos."</p>
            <p class="cite">-- Jos&eacute; Gervasio Artigas</p>
        </blockquote>
        <blockquote class="blockquote quoteBorder orderThree">
            <p class="quoteText">“A la empresa compatriotas, que el triunfo es nuestro: vencer o morir sea nuestra cifra y tiemblen, tiemblen esos tiranos de haber excitado vuestro enojo, sin advertir que los americanos del sud, est&aacute;n 
                dispuestos a defender su patria; y a morir antes con honor, que vivir con ignominia en afrentoso cautiverio."</p>
            <p class="cite">-- Jos&eacute; Gervasio Artigas</p>
        </blockquote>
        <blockquote class="blockquote quoteBorder orderFour">
            <p class="quoteText">“Clemencia para los vencidos, curad a los heridos, respetar a los prisioneros."</p>
            <p class="cite">-- Jos&eacute; Gervasio Artigas</p>
        </blockquote>
        <blockquote class="blockquote quoteBorder orderFive">
            <p class="quoteText">“Es muy veleidosa la probidad de los hombres, s&oacute;lo el freno de la Constituci&oacute;n puede afirmarla. Mientras ella no exista, es preciso adoptar las medidas que equivalgan a garant&iacute;a preciosa que ella ofrece."</p>
            <p class="cite">-- Jos&eacute; Gervasio Artigas</p>
        </blockquote>
        <blockquote class="blockquote quoteBorder orderSix">
            <p class="quoteText">“La libertad de Am&eacute;rica forma mi sistema y plantearlo es mi &uacute;nico anhelo."</p>
            <p class="cite">-- Jos&eacute; Gervasio Artigas</p>
        </blockquote>
    </section>

    <button onclick="topFunction()" id="myBtn" title="Go to top">Subir</button>

    <footer>
        <div class="footerContainer">
            <div class="contact">
                <h2>Contacto</h2>
                <div class="contactForm">
                    <form action="#" id="action">
                        <div class="nameBox">
                            <label for="name">Nombre</label>
                            <input type="text" id="name" required>
                        </div>
                        <div class="emailBox">
                            <label for="email">Correo electrónico</label>
                            <input type="email" id="email" required>
                        </div>
                        <div class="messageBox">
                            <label for="message">Mensaje</label>
                            <textarea name="message" rows ="10" cols="30" required></textarea>
                        </div>
                        <input class="submit" type="submit" value="Enviar">
                    </form>
                </div>
            </div>
            
        </div>
        <div class="info">
            <p>Created By <a class="contact" href="mailto:germanaraujo@hotmail.com" title="Contacto">Germán Araujo</a> &copy; 2023</p>
        </div>
    </footer>


    <script src="js/button.js"></script>
    <script src="js/sendEmail.js"></script>

</body>
</html>